In [102]:
import pandas as pd
pd.read_csv('noom_user.csv').head(1)

,Access Code,Name,Gender,Age,Height,Initial Weight,Lowest Weight,Target Weight,Product Name,Status,Price,Purchased At,Payment Type,Channel
0,Y9RY2VSI,김승혜,FEMALE,25.0,172.0,66.9,65.8,55.0,눔 체중감량 프로그램,completed,112500,2017-04-14 19:03:29.976000,Recurring,others

### Series

In [103]:
odd=[1,3,5,7,9]
odd

[1, 3, 5, 7, 9]

In [5]:
odd.mean()

AttributeError: 'list' object has no attribute 'mean'

In [4]:
pd_odd=pd.Series(odd)
pd_odd

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [6]:
pd_odd.mean()

5.0

### DataFrame

In [8]:
numbers = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
numbers

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [9]:
pd_numbers=pd.DataFrame(numbers)
pd_numbers

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

### Data Type

In [10]:
type(3)

int

In [11]:
type(3.0)

float

In [12]:
type("Hello!")

str

In [13]:
odd=[1,3,5,7,9]
odd=pd.Series(odd)
odd

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [14]:
odd.dtypes

dtype('int64')

In [15]:
odd=[1,3,5,7.0,9]
odd=pd.Series(odd)
odd

0    1.0
1    3.0
2    5.0
3    7.0
4    9.0
dtype: float64

In [16]:
odd.dtypes

dtype('float64')

In [17]:
odd=[1,3,5,7.0,"Hello!"]
odd=pd.Series(odd)
odd

0         1
1         3
2         5
3         7
4    Hello!
dtype: object

In [18]:
# O == Object == string
odd.dtypes

dtype('O')

In [19]:
import numpy as np

# NaN(Not a Number) - 값이 비어있음

odd=[1,3,5,7,np.nan]
odd=pd.Series(odd)
odd

0    1.0
1    3.0
2    5.0
3    7.0
4    NaN
dtype: float64

In [27]:
type(np.nan)

float

In [20]:
odd.dtypes

dtype('float64')

In [104]:
np.nan # use np.nan to match the nan value

nan

In [22]:
np.nan == "nan"

False

In [23]:
np.nan == "NaN"

False

### DataFrame

In [30]:
transaction_url="https://bit.ly/dsa-transaction"
transaction=pd.read_csv(transaction_url)
transaction

   Name        date  price      state
0  Kang  2017-01-01    500  confirmed
1   Kim  2017-01-03    700  confirmed
2  Choi  2017-01-03    900  confirmed
3  Park  2017-01-05    800  confirmed
4   Lee  2017-01-07    500   canceled
5  Yoon  2017-01-09    700  confirmed
6  Jang  2017-01-09    600   canceled
7    Ko  2017-01-10    200   canceled

In [31]:
transaction_url="https://bit.ly/dsa-transaction"
transaction=pd.read_csv(transaction_url, index_col="Name")
transaction

            date  price      state
Name
Kang  2017-01-01    500  confirmed
Kim   2017-01-03    700  confirmed
Choi  2017-01-03    900  confirmed
Park  2017-01-05    800  confirmed
Lee   2017-01-07    500   canceled
Yoon  2017-01-09    700  confirmed
Jang  2017-01-09    600   canceled
Ko    2017-01-10    200   canceled

In [32]:
transaction=pd.read_csv(transaction_url)
transaction = transaction.set_index("Name")
transaction

            date  price      state
Name
Kang  2017-01-01    500  confirmed
Kim   2017-01-03    700  confirmed
Choi  2017-01-03    900  confirmed
Park  2017-01-05    800  confirmed
Lee   2017-01-07    500   canceled
Yoon  2017-01-09    700  confirmed
Jang  2017-01-09    600   canceled
Ko    2017-01-10    200   canceled

In [33]:
transaction.index

Index(['Kang', 'Kim', 'Choi', 'Park', 'Lee', 'Yoon', 'Jang', 'Ko'], dtype='object', name='Name')

In [34]:
transaction.columns

Index(['date', 'price', 'state'], dtype='object')

In [35]:
transaction.values

array([['2017-01-01', 500, 'confirmed'],
       ['2017-01-03', 700, 'confirmed'],
       ['2017-01-03', 900, 'confirmed'],
       ['2017-01-05', 800, 'confirmed'],
       ['2017-01-07', 500, 'canceled'],
       ['2017-01-09', 700, 'confirmed'],
       ['2017-01-09', 600, 'canceled'],
       ['2017-01-10', 200, 'canceled']], dtype=object)

In [36]:
type(transaction.values)

numpy.ndarray

In [38]:
transaction.columns=["date","amount","result"]
transaction

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled
Ko    2017-01-10     200   canceled

In [39]:
transaction.head(100)

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled
Ko    2017-01-10     200   canceled

In [40]:
transaction.tail(100)

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled
Ko    2017-01-10     200   canceled

### sorting

In [41]:
transaction.sort_index()

            date  amount     result
Name
Choi  2017-01-03     900  confirmed
Jang  2017-01-09     600   canceled
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Ko    2017-01-10     200   canceled
Lee   2017-01-07     500   canceled
Park  2017-01-05     800  confirmed
Yoon  2017-01-09     700  confirmed

In [42]:
transaction.sort_index(ascending=False)

            date  amount     result
Name
Yoon  2017-01-09     700  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Ko    2017-01-10     200   canceled
Kim   2017-01-03     700  confirmed
Kang  2017-01-01     500  confirmed
Jang  2017-01-09     600   canceled
Choi  2017-01-03     900  confirmed

In [43]:
transaction.sort_values(by='amount')

            date  amount     result
Name
Ko    2017-01-10     200   canceled
Kang  2017-01-01     500  confirmed
Lee   2017-01-07     500   canceled
Jang  2017-01-09     600   canceled
Kim   2017-01-03     700  confirmed
Yoon  2017-01-09     700  confirmed
Park  2017-01-05     800  confirmed
Choi  2017-01-03     900  confirmed

In [44]:
transaction.sort_values(by='amount',ascending=False)

            date  amount     result
Name
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Kim   2017-01-03     700  confirmed
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled
Kang  2017-01-01     500  confirmed
Lee   2017-01-07     500   canceled
Ko    2017-01-10     200   canceled

In [45]:
transaction.sort_values(by=["date","amount"])

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Jang  2017-01-09     600   canceled
Yoon  2017-01-09     700  confirmed
Ko    2017-01-10     200   canceled

In [47]:
transaction.sort_values(by=["date","amount"],ascending=[True,False])

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Choi  2017-01-03     900  confirmed
Kim   2017-01-03     700  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled
Ko    2017-01-10     200   canceled

In [46]:
transaction["amount"].sort_values()

Name
Ko      200
Kang    500
Lee     500
Jang    600
Kim     700
Yoon    700
Park    800
Choi    900
Name: amount, dtype: int64

### Basic Operations

In [48]:
transaction["amount"].mean()

612.5

In [49]:
transaction["amount"].min()

200

In [50]:
transaction["result"].unique()

array(['confirmed', 'canceled'], dtype=object)

In [52]:
transaction["result"].value_counts()

confirmed    5
canceled     3
Name: result, dtype: int64

In [110]:
transaction["result"].value_counts(normalize=True) # show percentages

confirmed    0.625
canceled     0.375
Name: result, dtype: float64

### pivot table

In [55]:
pd.pivot_table(transaction,index='result',values='amount') # default = avg

               amount
result
canceled   433.333333
confirmed  720.000000

In [58]:
pd.pivot_table(transaction,
               index='result',
               values='amount',
               aggfunc='sum')

           amount
result
canceled     1300
confirmed    3600

In [59]:
pd.pivot_table(transaction,
               index=['date','result'],
               values='amount',
               aggfunc='sum')

                      amount
date       result
2017-01-01 confirmed     500
2017-01-03 confirmed    1600
2017-01-05 confirmed     800
2017-01-07 canceled      500
2017-01-09 canceled      600
           confirmed     700
2017-01-10 canceled      200

### Group By

In [60]:
transaction["amount"].mean()

612.5

In [62]:
transaction.groupby("result")["amount"].mean()

result
canceled     433.333333
confirmed    720.000000
Name: amount, dtype: float64

In [64]:
transaction.groupby(["date","result"])["amount"].sum()

date        result
2017-01-01  confirmed     500
2017-01-03  confirmed    1600
2017-01-05  confirmed     800
2017-01-07  canceled      500
2017-01-09  canceled      600
            confirmed     700
2017-01-10  canceled      200
Name: amount, dtype: int64

### matrix approach

In [65]:
transaction["date"]

Name
Kang    2017-01-01
Kim     2017-01-03
Choi    2017-01-03
Park    2017-01-05
Lee     2017-01-07
Yoon    2017-01-09
Jang    2017-01-09
Ko      2017-01-10
Name: date, dtype: object

In [67]:
type(transaction["date"])

pandas.core.series.Series

In [66]:
transaction[["date","amount"]] # [[]] makes it a DataFrame.

            date  amount
Name
Kang  2017-01-01     500
Kim   2017-01-03     700
Choi  2017-01-03     900
Park  2017-01-05     800
Lee   2017-01-07     500
Yoon  2017-01-09     700
Jang  2017-01-09     600
Ko    2017-01-10     200

In [68]:
type(transaction[["date","amount"]])

pandas.core.frame.DataFrame

In [69]:
# loc == locate
transaction.loc['Kang']

date      2017-01-01
amount           500
result     confirmed
Name: Kang, dtype: object

In [71]:
# loc == locate
transaction.loc[['Kang','Kim','Choi']]

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed

In [77]:
transaction

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled
Ko    2017-01-10     200   canceled

In [117]:
%timeit transaction.loc["Kang","date"] # faster method than below

8.72 µs ± 346 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [118]:
%timeit transaction.loc["Kang"]["date"] # it approaches the DataFrame twice

167 µs ± 6.79 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [72]:
transaction.loc["Kang","date"] # index, column

'2017-01-01'

In [75]:
transaction.loc[["Kang","Kim"],"date"]

Name
Kang    2017-01-01
Kim     2017-01-03
Name: date, dtype: object

### indexing

In [78]:
transaction["date"]

Name
Kang    2017-01-01
Kim     2017-01-03
Choi    2017-01-03
Park    2017-01-05
Lee     2017-01-07
Yoon    2017-01-09
Jang    2017-01-09
Ko      2017-01-10
Name: date, dtype: object

In [119]:
transaction["date"]=="2017-01-03" # return boolean Series

Name
Kang    False
Kim      True
Choi     True
Park    False
Lee     False
Yoon    False
Jang    False
Ko      False
Name: date, dtype: bool

In [80]:
transaction[transaction["date"]=="2017-01-03"]

            date  amount     result
Name
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed

In [81]:
transaction['amount']<600

Name
Kang     True
Kim     False
Choi    False
Park    False
Lee      True
Yoon    False
Jang    False
Ko       True
Name: amount, dtype: bool

In [83]:
transaction[transaction['amount']<600]

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Lee   2017-01-07     500   canceled
Ko    2017-01-10     200   canceled

In [84]:
confirmed = transaction["result"]=="confirmed"
high_paid = transaction["amount"]>=500
transaction[confirmed & high_paid]

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Yoon  2017-01-09     700  confirmed

In [90]:
transaction[confirmed and high_paid]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

### column addition & fixing

In [91]:
transaction["card-holder"] = "KB Card"
transaction

            date  amount     result card-holder
Name
Kang  2017-01-01     500  confirmed     KB Card
Kim   2017-01-03     700  confirmed     KB Card
Choi  2017-01-03     900  confirmed     KB Card
Park  2017-01-05     800  confirmed     KB Card
Lee   2017-01-07     500   canceled     KB Card
Yoon  2017-01-09     700  confirmed     KB Card
Jang  2017-01-09     600   canceled     KB Card
Ko    2017-01-10     200   canceled     KB Card

In [92]:
transaction["order"]=[1,3,2,7]

ValueError: Length of values does not match length of index

In [94]:
transaction["order"]=[1,3,2,7,4,5,6,8]
transaction

            date  amount     result card-holder  order
Name
Kang  2017-01-01     500  confirmed     KB Card      1
Kim   2017-01-03     700  confirmed     KB Card      3
Choi  2017-01-03     900  confirmed     KB Card      2
Park  2017-01-05     800  confirmed     KB Card      7
Lee   2017-01-07     500   canceled     KB Card      4
Yoon  2017-01-09     700  confirmed     KB Card      5
Jang  2017-01-09     600   canceled     KB Card      6
Ko    2017-01-10     200   canceled     KB Card      8

In [95]:
transaction.loc[transaction["amount"] >= 500, "paid-type"] = "High"
transaction.loc[transaction["amount"] < 500, "paid-type"] = "Low"
transaction

            date  amount     result card-holder  order paid-type
Name
Kang  2017-01-01     500  confirmed     KB Card      1      High
Kim   2017-01-03     700  confirmed     KB Card      3      High
Choi  2017-01-03     900  confirmed     KB Card      2      High
Park  2017-01-05     800  confirmed     KB Card      7      High
Lee   2017-01-07     500   canceled     KB Card      4      High
Yoon  2017-01-09     700  confirmed     KB Card      5      High
Jang  2017-01-09     600   canceled     KB Card      6      High
Ko    2017-01-10     200   canceled     KB Card      8       Low

In [120]:
transaction.loc[transaction["amount"] >= 500, "paid-type2"] = "High"
transaction

,date,amount,result,card-holder,order,paid-type,paid-tpye,paid-type2
Name,,,,,,,,
Kang,2017-01-01,500,confirmed,KB Card,1,High,High,High
Kim,2017-01-03,700,confirmed,KB Card,3,High,High,High
Choi,2017-01-03,900,confirmed,KB Card,2,High,High,High
Park,2017-01-05,800,confirmed,KB Card,7,High,High,High
Lee,2017-01-07,500,canceled,KB Card,4,High,High,High
Yoon,2017-01-09,700,confirmed,KB Card,5,High,High,High
Jang,2017-01-09,600,canceled,KB Card,6,High,High,High
Ko,2017-01-10,200,canceled,KB Card,8,Low,Low,NaN

### apply

In [121]:
def is_high_paid(amount):
    return amount

transaction["amount"].apply(is_high_paid)

Name
Kang    500
Kim     700
Choi    900
Park    800
Lee     500
Yoon    700
Jang    600
Ko      200
Name: amount, dtype: int64

In [98]:
def is_high_paid(amount):
    if amount>=500:
        return "High"
    else:
        return "Low"

transaction["paid-tpye"] = transaction["amount"].apply(is_high_paid)
transaction

            date  amount     result card-holder  order paid-type paid-tpye
Name
Kang  2017-01-01     500  confirmed     KB Card      1      High      High
Kim   2017-01-03     700  confirmed     KB Card      3      High      High
Choi  2017-01-03     900  confirmed     KB Card      2      High      High
Park  2017-01-05     800  confirmed     KB Card      7      High      High
Lee   2017-01-07     500   canceled     KB Card      4      High      High
Yoon  2017-01-09     700  confirmed     KB Card      5      High      High
Jang  2017-01-09     600   canceled     KB Card      6      High      High
Ko    2017-01-10     200   canceled     KB Card      8       Low       Low